# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at https://mozilla.org/MPL/2.0/.


### URL: https://www-dev.springfield.moz.works/features/adblocker/

# Breadcrumb navigation
features-adblocker-ad-blocking = Գովազդի արգելափակում
# Page Title
features-adblocker-meta-title-v2 = Գովազդի արգելափակման մասին
# Obsolete string (expires 16-09-2025)
features-adblocker-meta-title = Գովազդի արգելափակիչների մասին - { -brand-name-firefox }
# HTML page description
features-adblocker-meta-desc = Իմացեք, թե ինչպես են աշխատում գովազդի արգելափակիչները, ինչ կարող են անել ձեզ համար, և ինչպես է { -brand-name-firefox }-ը պաշտպանում ձեզ հետևորդներից և թխուկներից։
features-adblocker-the-ad-blocker-a-tool = Գովազդի արգելափակիչ՝ գործիք անհատականացված և կենտրոնացված զննարկման փորձի համար։
features-adblocker-in-todays-digital-world = Այսօրվա թվային աշխարհում համացանցը կարող է լինել շատ զբաղված և խառնաշփոթ։ Գովազդի արգելափակիչները հզոր գործիքներ են, որոնք թույլ են տալիս ձեզ վերահսկել ձեր դիտարկիչը փորձը՝ թույլ տալով ձեզ որոշել, թե ինչ է երևալու ձեր էկրանին։
features-adblocker-ad-blockers-work = Գովազդի արգելափակիչները գործում են երկու հիմնական եղանակով՝ կանխելով բովանդակության, օրինակ՝ գովազդների, բեռնումը և արգելափակելով կայքերի այն հատվածները, որոնք պարունակում են այդ տարրերը: Սա կարող է ներառել տեսագովազդներ, անհատականացված գովազդներ, որոնք հետևում են ձեզ ամբողջ համացանցում, և նույնիսկ երրորդ կողմի հետևորդներ:
# Variables:
#   $firefox (url) - link to https://www.firefox.com/
#   $addons (url) - link to https://blog.mozilla.org/firefox/ad-blocker-roundup-5-adblockers-that-improve-your-internet-experience/
features-adblocker-using-an-adblocker = Գովազդի արգելափակիչ օգտագործելը շատ պարզ է: Բազմաթիվ վստահելի տարբերակներ հասանելի են որպես դիտարկիչի հավելումներ, ինչը հեշտացնում է ձեր կարիքներին համապատասխանող լուծում գտնելը: Օրինակ՝ <a href="{ $firefox }">{ -brand-name-firefox }</a>-ը առաջարկում է <a href="{ $addons }">հաստատված ընդլայնումների ցանկ</a>, որը նախատեսված է ձեր դիտարկման փորձը բարելավելու համար՝ հարգելով ձեր գաղտնիությունը:
features-adblocker-finding-the-right = Գտեք ձեզ համար ճիշտ գովազդի արգելափակիչը
features-adblocker-there-are-many = Կան բազմաթիվ գովազդի արգելափակման գործիքներ, որոնք կարելի է ուսումնասիրել, որոնցից յուրաքանչյուրն առաջարկում է տարբեր նախասիրություններին համապատասխանող գործառույթներ: Ձեզ համար ճիշտը գտնելը կախված է ձեր ցանկություններից և դիտարկիչ սովորություններից: Ահա մի քանի խորհուրդ, որոնք պետք է հաշվի առնել.
features-adblocker-tip-1 = <strong>Գովազդի արգելափակում.</strong> Եթե ուզում եք միայն գովազդ արգելափակել, ընտրեք պարզ և թեթև տարբերակ։
features-adblocker-tip-2 = <strong>Գաղտնիության հետ կապված մտահոգություններ.</strong> Եթե անհանգստանում եք հետագծողների համար, փնտրեք գովազդի արգելափակիչ՝ ներկառուցված գաղտնիության գործառույթներով։
features-adblocker-tip-3 = <strong>Կարգավորելիություն.</strong> Որոշ գովազդային արգելափակիչներ թույլ են տալիս ճշգրտումներ կատարել՝ որոշակի կայքեր սպիտակ ցուցակում ներառելու կամ որոշակի տարրեր արգելափակելու համար:
features-adblocker-tip-4 = <strong>Սարքերի համատեղելիություն.</strong> Հաշվի առեք, թե արդյոք այն ձեզ անհրաժեշտ է համակարգչի, բջջայինի, թե երկուսի համար էլ։
features-adblocker-tip-5 = <strong>Վնասակար ծրագրերի արգելափակում.</strong> Որոշ գովազդային արգելափակիչներ պաշտպանում են վնասակար գովազդներից (օրինակ՝ AdGuard):
features-adblocker-tip-6 = <strong>Ծնողական վերահսկողություն.</strong> Օգտակար է, եթե ցանկանում եք արգելափակել անպատշաճ բովանդակությունը:
features-adblocker-its-important-to-note = Կարևոր է նշել, որ որոշ կայքեր օգտագործում են գովազդներ՝ բովանդակություն բեռնելու կամ ֆունկցիոնալություն ապահովելու համար: Գովազդի արգելափակումը կարող է հանգեցնել որոշ գործառույթների խափանման, օրինակ՝ տեսանյութերի չնվագարկման կամ մուտքի տարբերակների խափանման: Ընտրեք գովազդի արգելափակիչ, որը պարբերաբար թարմացվում է, և եթե նկատեք, որ մեկ գովազդի արգելափակիչ լուրջ խնդիրներ է առաջացնում, փորձեք մեկ այլ՝ աշխատանքի և համատեղելիության ավելի լավ հավասարակշռություն գտնելու համար:
features-adblocker-enhanced-privacy = Բարելավված գաղտնիություն և արդյունավետություն { -brand-name-firefox }-ի միջոցով
features-adblocker-beyond-ad-blockers = Գովազդի արգելափակիչներից զատ, { -brand-name-firefox }-ը ներառում է ներկառուցված գործառույթներ, որոնք ձեզ ավելի մեծ վերահսկողություն են տալիս ձեր զննարկման նկատմամբ: Այս գործիքները օգնում են պաշտպանել ձեր գաղտնիությունը՝ միաժամանակ թույլ տալով ձեզ անհատականացնել ձեր փորձը.
features-adblocker-tool-1 = <strong>Ստանդարտ ռեժիմ.</strong> Հավասարակշռված տարբերակ, որն արգելափակում է տարածված հետևորդները՝ միաժամանակ պահպանելով կայքի անխափան աշխատանքը։
features-adblocker-tool-2 = <strong>Խիստ կերպ.</strong> Իդեալական է այն օգտատերերի համար, ովքեր ցանկանում են ավելի ուժեղ գաղտնիության պաշտպանություն՝ ավելի շատ հետևորդներ և թխուկներ արգելափակելով: Նկատի ունեցեք, որ որոշ կայքեր կարող են պահանջել կարգավորումներ այս կերպում:
features-adblocker-tool-3 = <strong>Անհատական կերպ.</strong> Նրանց համար, ովքեր ցանկանում են լիակատար վերահսկողություն, «Անհատական ռեժիմը» թույլ է տալիս ընտրել, թե ինչը արգելափակել՝ սկսած թխուկներից մինչև հետևորդներ և այլն:
features-adblocker-to-adjust = Այս կարգավորումները կարգավորելու համար սեղմեք ցանկացած վեբ էջի հասցեի տողի ձախ կողմում գտնվող վահանի պատկերակը և ընտրեք «Պաշտպանության կարգավորումներ»: Սա կբացի մենյու, որտեղ կարող եք ընտրել ձեզ համար ճիշտ պաշտպանության մակարդակը:
features-adblocker-why-use = Ինչո՞ւ օգտագործել գովազդի արգելափակիչ:
