# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at https://mozilla.org/MPL/2.0/.


### URL: https://www-dev.springfield.moz.works/more/best-browser/

best-browser-find-your-best-browser = Գտեք ձեր լավագույն դիտարկիչը արագության, գաղտնիության և անվտանգության համար։
best-browser-so-many-browser-options = Այնքան շատ դիտարկիչի տարբերակներ կան, բայց միայն մեկն է լավագույնս համապատասխանում ձեր կարիքներին։ Ձեզ համար լավագույն դիտարկիչը պետք է ապահովի և՛ արագություն, և՛ գաղտնիության պաշտպանություն։
best-browser-privacy-speed-and-security = Գաղտնիություն, արագություն և անվտանգություն։
best-browser-how-to-choose-the-best = Ինչպես ընտրել ձեզ համար լավագույն դիտարկիչը։
best-browser-the-internet-has-become = Համացանցը դարձել է նույնքան կարևոր, որքան էլեկտրաէներգիան և հոսող ջուրը, ուստի ձեզ համար լավագույն զննարկիչը ընտրելն ավելի կարևոր է, քան երբևէ: Ինտերնետը երկրորդ գրասենյակ է, ուսուցիչ և երբեմն բժշկական խորհրդատու, նույնիսկ եթե ձեր իրական բժիշկը կնախընտրեր, որ դուք ձեր ախտանիշները չփնտրեիք առցանց:
best-browser-in-the-mid-nineties = Իննսունականների կեսերին աշխարհում գերիշխում էին { -brand-name-netscape }, { -brand-name-ie } և AOL ընկերությունները։ Ավելի պարզ ժամանակներ էին, երբ dial-up ինտերնետի քաղցր մեղեդին հնչում էր ամբողջ երկրում։ Դուք սովորում էիք համբերատար սպասել վեբ էջերի բեռնմանը։ Այն ժամանակ կարևորը միայն զննարկչի արագությունն էր։
best-browser-today-is-a-different = Այսօր պատմությունն այլ է։ Գովազդները, գաղտնիության հաքերային հարձակումները, անվտանգության խախտումները և կեղծ լուրերը կարող են ձեզ ստիպել նայել զննարկչի այլ հատկանիշներին։ Ինչպե՞ս է զննարկիչը պաշտպանում ձեր գաղտնիությունը։ Արդյո՞ք այն թույլ է տալիս հետևորդներին հետևել ձեզ ամբողջ համացանցում։ Արդյո՞ք այն նախատեսված է միաժամանակ բազմաթիվ գործողություններ կատարելու և բազմաթիվ համակարգչային ու ինտերնետային գործողություններ կատարելու համար։
best-browser-when-you-use-a-browser = Երբ դուք օգտագործում եք դիտարկիչ ամեն ինչի համար, այն պետք է արագ լինի։ Սակայն նույն պատճառով այն պետք է լինի գաղտնի։ Դիտարկիչը հասանելիություն ունի ձեր առցանց կատարած ամեն ինչին, ուստի այն կարող է ձեզ իրական ռիսկի ենթարկել, եթե այն չունի ուժեղ գաղտնիության գործառույթներ։
best-browser-marshall-erwin-senior = Marshall Erwin, վստահության և անվտանգության ավագ տնօրեն { -brand-name-mozilla }-ում
best-browser-if-youre-wondering = Եթե հետաքրքրված եք, թե ինչ է նշանակում ունենալ անձնական կամ արագ դիտարկիչ, ահա երեք բան, որոնք պետք է ունենա դիտարկիչը։
best-browser-a-browser-built-for = Արագության համար նախատեսված դիտարկիչ։
best-browser-a-browser-is-still = Դիտարկիչը դեռևս գործիք է, ուստի տրամաբանական է, որ դուք կցանկանաք ընտրել լավագույնը այդ աշխատանքի համար: Եթե դուք մարդ եք, ով պետք է աշխատի գոյատևելու համար, ձեզ անհրաժեշտ կլինի արագ ինտերնետային զննարկիչ: Մի բան, որը պետք է հիշել, այն է, որ այն զննարկիչը, որը գործարկում է երրորդ կողմի հետևորդներ, ավելի հավանական է, որ ավելի դանդաղ լինի, քան այն զննարկիչը, որը չի գործարկում: Երրորդ կողմի հետևորդները թխուկներ են, և չնայած դուք չեք կարող տեսնել դրանք, դրանք աշխատում են կայքի ֆոնային ռեժիմում՝ զբաղեցնելով թանկարժեք ժամանակ: Որքան շատ երրորդ կողմի հետևորդներ է դիտարկիչը արգելափակում, այնքան ավելի արագ կարող է այն աշխատել:
