# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at https://mozilla.org/MPL/2.0/.


### URL: https://www-dev.springfield.moz.works/more/what-is-a-browser/

# HTML page title
what-is-a-browser-what-is-a-web = Ի՞նչ է վեբ դիտարկիչը։
# HTML page description
what-is-a-browser-a-web-browser = Վեբ դիտարկիչը ձեզ տանում է ինտերնետի ցանկացած վայր՝ թույլ տալով տեսնել տեքստ, պատկերներ և տեսանյութեր աշխարհի ցանկացած վայրից։
what-is-a-browser-the-web-is-a-vast = Համացանցը հսկայական և հզոր գործիք է։ Մի քանի տասնամյակների ընթացքում ինտերնետը փոխել է մեր աշխատանքի, խաղի և միմյանց հետ փոխազդեցության ձևը։ Կախված նրանից, թե ինչպես է այն օգտագործվում, այն կամուրջ է կապում ազգերի միջև, խթանում է առևտուրը, սնուցում հարաբերությունները, առաջ մղում ապագայի նորարարական շարժիչը և պատասխանատու է ավելի շատ մեմերի համար, քան մենք գիտենք՝ ինչ անել դրանց հետ։
# Variables:
#   $tools (url) - link to https://blog.mozilla.org/firefox/internet-search-engine-browser/
what-is-a-browser-its-important = Կարևոր է, որ բոլորը հասանելիություն ունենան համացանցին, բայց նաև կարևոր է, որ մենք բոլորս <a href="{ $tools }">հասկանանք այն գործիքները</a>, որոնք օգտագործում ենք դրան հասանելիություն ստանալու համար: Մենք ամեն օր օգտագործում ենք վեբ զննարկիչներ, ինչպիսիք են՝ { -brand-name-mozilla } { -brand-name-firefox }, { -brand-name-google } { -brand-name-chrome }, { -brand-name-microsoft } { -brand-name-edge } և { -brand-name-apple } { -brand-name-safari }, բայց արդյո՞ք մենք հասկանում ենք, թե դրանք ինչ են և ինչպես են աշխատում:
what-is-a-browser-in-a-short-period-long = Կարճ ժամանակահատվածում մենք աշխարհի տարբեր ծայրերում գտնվող մարդկանց էլեկտրոնային նամակ ուղարկելու հնարավորությամբ զարմացած լինելուց անցանք տեղեկատվության մասին մեր պատկերացումների փոփոխության։ Այլևս հարց չէ, թե որքան գիտեք, այլ պարզապես հարց է, թե որ զննարկիչը կամ հավելվածը կարող է ձեզ ամենաարագը հասցնել այդ տեղեկատվությանը։
what-is-a-browser-in-a-short-period = Կարճ ժամանակահատվածում մենք աշխարհի տարբեր ծայրերում գտնվող մարդկանց էլեկտրոնային նամակ ուղարկելու հնարավորությամբ զարմացած լինելուց անցանք տեղեկատվության վերաբերյալ մեր մտածելակերպի փոփոխության։
what-is-a-browser-how-does-a-web = Ինչպե՞ս է աշխատում վեբ դիտարկիչը։
what-is-a-browser-a-web-browser-long = Վեբ դիտարկիչը ձեզ տանում է համացանցի ցանկացած վայր։ Այն տեղեկատվություն է վերցնում վեբի այլ մասերից և ցուցադրում այն ձեր համակարգչի կամ բջջային սարքի վրա։ Տեղեկատվությունը փոխանցվում է հիպերտեքստի փոխանցման արձանագրության միջոցով, որը սահմանում է, թե ինչպես են տեքստը, պատկերները և տեսանյութերը փոխանցվում վեբում։ Այս տեղեկատվությունը պետք է տարածվի և ցուցադրվի հետևողական ձևաչափով, որպեսզի աշխարհի ցանկացած վայրում գտնվող ցանկացած զննարկիչ օգտագործող մարդիկ կարողանան տեսնել տեղեկատվությունը։
# Variables:
#   $standards (url) - link to https://developer.mozilla.org/docs/Archive/Web_Standards
what-is-a-browser-sadly-not-all = Ցավոք, ոչ բոլոր դիտարկիչների ստեղծողներն են ընտրում ձևաչափը նույն կերպ մեկնաբանել։ Օգտատերերի համար սա նշանակում է, որ կայքը կարող է տարբեր տեսք ունենալ և գործել։ Զննարկիչների միջև համապատասխանության ստեղծումը, որպեսզի ցանկացած օգտատեր կարողանա վայելել ինտերնետը՝ անկախ իր ընտրած զննարկչից, կոչվում է <a href="{ $standards }">վեբ ստանդարտներ</a>։
# Variables:
#   $html (url) - link to https://developer.mozilla.org/docs/Glossary/HTML
what-is-a-browser-when-the-web-browser = Երբ վեբ դիտարկիչը տվյալներ է ստանում համացանցին միացված սերվերից, այն օգտագործում է մի ծրագիր, որը կոչվում է ռենդերինգային շարժիչ, որպեսզի այդ տվյալները վերածի տեքստի և պատկերների: Այս տվյալները գրվում են <a href="{ $html }">Հիպերտեքստի նշագրման լեզվով</a> (HTML) և վեբ դիտարկիչները կարդում են այս կոդը՝ ստեղծելու համար այն, ինչ մենք տեսնում, լսում և զգում ենք ինտերնետում:
# Variables:
#   $hyperlink (url) - link to https://developer.mozilla.org/docs/Glossary/Hyperlink
#   $url(url) - link to https://wikipedia.org/wiki/URL
what-is-a-browser-hyperlinks-allow = <a href="{ $hyperlink }">Հիպերհղումները</a> թույլ են տալիս օգտատերերին հետևել ցանցում այլ էջերի կամ կայքերի ուղուն: Յուրաքանչյուր վեբ էջ, պատկեր և տեսանյութ ունի իր յուրահատուկ <a href="{ $url }">Միասնական ռեսուրսների որոնիչ</a> (URL), որը հայտնի է նաև որպես վեբ հասցե: Երբ զննարկիչը մուտք է գործում սերվեր՝ տվյալներ ստանալու համար, վեբ հասցեն ցույց է տալիս զննարկչին, թե որտեղ փնտրել html-ում նկարագրված յուրաքանչյուր տարր, որն էլ իր հերթին ցույց է տալիս դիտարկիչին, թե որտեղ է այն գնում վեբ էջում:
what-is-a-browser-cookies-not-the = Թխուկները (ոչ այնքան համեղ տեսակի)
# Variables:
#   $cookies (url) - link to https://wikipedia.org/wiki/HTTP_cookie
what-is-a-browser-websites-save = Կայքերը ձեր մասին տեղեկությունները պահպանում են <a href="{ $cookies }">cookies</a> կոչվող ֆայլերում: Դրանք պահվում են ձեր համակարգչում՝ այդ կայքը հաջորդ անգամ այցելելիս օգտագործելու համար: Վերադառնալուց հետո կայքի կոդը կկարդա այդ ֆայլը՝ տեսնելու համար, որ դա դուք եք: Օրինակ, երբ դուք այցելում եք որևէ կայք, էջը հիշում է ձեր օգտանունն ու գաղտնաբառը, ինչը հնարավոր է դառնում cookie-ի շնորհիվ:
what-is-a-browser-there-are-also = Կան նաև թխուկներ, որոնք հիշում են ձեր մասին ավելի մանրամասն տեղեկություններ: Հնարավոր է՝ ձեր հետաքրքրությունները, ձեր վեբ զննարկման սովորությունները և այլն: Սա նշանակում է, որ կայքը կարող է ձեզ տրամադրել ավելի նպատակային բովանդակություն՝ հաճախ գովազդի տեսքով: Կան թխուկների տեսակներ, որոնք կոչվում են <em>երրորդ կողմի</em> թխուկներ, որոնք գալիս են այն կայքերից, որոնք դուք այդ պահին նույնիսկ չեք այցելում, և կարող են հետևել ձեզ կայքից կայք՝ ձեր մասին տեղեկություններ հավաքելու համար, որոնք երբեմն վաճառվում են այլ ընկերություններին: Երբեմն դուք կարող եք արգելափակել այս տեսակի թխուկները, չնայած ոչ բոլոր դիտարկիչներն են թույլ տալիս դա:
what-is-a-browser-when-you-go-to = Երբ դուք մտնում եք որևէ կայք, և էջը հիշում է ձեր օգտանունն ու գաղտնաբառը, դա հնարավոր է դառնում թխուկների շնորհիվ։
what-is-a-browser-understanding = Գաղտնիության ըմբռնումը
what-is-a-browser-nearly-all-major = Գրեթե բոլոր հիմնական զննարկիչներն ունեն անձնական զննարկման կարգավորում։ Դրանք գոյություն ունեն զննարկման պատմությունը նույն համակարգչի մյուս օգտատերերից թաքցնելու համար։ Շատերը կարծում են, որ անձնական զննարկումը կամ ինկոգնիտո ռեժիմը կթաքցնի իրենց ինքնությունը և զննարկման պատմությունը ինտերնետային ծառայություն մատուցողներից, կառավարություններից և գովազդատուներից։ Նրանք այդպես չեն անում։ Այս կարգավորումները պարզապես մաքրում են ձեր համակարգի պատմությունը, ինչը օգտակար է, եթե դուք գործ ունեք զգայուն անձնական տեղեկատվության հետ համատեղ կամ հանրային համակարգչի վրա։ { -brand-name-firefox }-ը դրանից այն կողմ է գնում։
what-is-a-browser-firefox-helps = { -brand-name-firefox }-ը օգնում է ձեզ ավելի գաղտնի լինել առցանց՝ թույլ տալով ձեզ արգելափակել հետագծողներին, որպեսզի նրանք չհետևեն ձեզ համացանցում։
what-is-a-browser-making-your-web = Ձեր վեբ դիտարկիչը ձեզ համար աշխատեցնելը
what-is-a-browser-most-major-web = Հիմնական վեբ զննարկիչների մեծ մասը թույլ է տալիս օգտատերերին փոփոխել իրենց փորձը ընդլայնումների կամ հավելումների միջոցով: Ընդլայնումները ծրագրային ապահովման մասեր են, որոնք կարող եք ավելացնել ձեր դիտարկիչին՝ այն անհատականացնելու կամ ֆունկցիոնալություն ավելացնելու համար: Ընդլայնումները կարող են անել ամեն տեսակի զվարճալի և գործնական բաներ, ինչպիսիք են նոր գործառույթների, օտար լեզուների բառարանների կամ տեսողական տեսքի և թեմաների ակտիվացումը:
what-is-a-browser-all-browser-makers = Բոլոր դիտարկիչների արտադրողները մշակում են իրենց արտադրանքը՝ պատկերներն ու տեսանյութերը հնարավորինս արագ և սահուն ցուցադրելու համար, ինչը հեշտացնում է ձեզ համար համացանցից առավելագույնս օգտվելը: Նրանք բոլորն էլ աշխատում են, որպեսզի օգտատերերն ունենան արագ, հզոր և հեշտ օգտագործման զննարկիչ: Տարբերությունները հենց դրա պատճառն են: Կարևոր է ընտրել ձեզ համար ճիշտ զննարկիչը: { -brand-name-mozilla }-ն ստեղծում է { -brand-name-firefox }-ը՝ ապահովելու համար, որ օգտատերերը վերահսկեն իրենց առցանց կյանքը և ապահովի, որ համացանցը գլոբալ, հանրային ռեսուրս լինի, որը հասանելի է բոլորի համար:
