# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at https://mozilla.org/MPL/2.0/.


### URL: https://www-dev.springfield.moz.works/browsers/mobile/ios/

# HTML page title
mobile-ios-firefox-browser-ios = { -brand-name-firefox-browser } { -brand-name-ios } ({ -brand-name-iphone } & { -brand-name-ipad })
mobile-ios-firefox-browser = { -brand-name-firefox-browser }
mobile-ios-get-firefox-for = Ձեռք բեր { -brand-name-firefox }-ը { -brand-name-ios }-ի համար
mobile-ios-send-a-download-link-to-your = Ուղարկել ներբեռնման հղումը ձեր հեռախոսին:
mobile-ios-scan-the-qr-code-to-get-started = Սկանավորեք QR կոդը՝ սկսելու համար:
mobile-ios-scan-alt-text = Սկանավորեք QR կոդը՝ { -brand-name-firefox }-ը { -brand-name-ios }-ում ստանալու համար
mobile-ios-make-firefox-your = Դարձրեք { -brand-name-firefox }-ը ձեր սկզբնադիր դիտարկիչը
mobile-ios-now-iphone-and = Այժմ { -brand-name-iphone } և { -brand-name-ipad } օգտատերերը կարող են ընտրել իրենց սեփական սկզբնադիր դիտարկիչը։ Դա նշանակում է, որ դուք չեք ստիպված օգտագործել { -brand-name-safari }-ը, և ձեր բջջային դիտարկիչը կարող է համաժամեցված մնալ ձեր նախընտրած համակարգչային դիտարկիչի հետ։ Բացի այդ, երբ դուք սահմանում եք { -brand-name-firefox }-ը որպես ձեր լռելյայն դիտարկիչ, դուք աջակցում եք անկախ տեխնոլոգիական ընկերության։ { -brand-name-firefox }-ը նաև միակ խոշոր դիտարկիչն է, որը հովանավորվում է ոչ առևտրային կազմակերպության կողմից։
mobile-ios-fast-private-secure = Արագ։ Գաղտնի։ Անվտանգ
mobile-ios-keep-whats-personal = Պահպանեք անձնական տվյալները գաղտնի՝ առանց զոհաբերելու անհավանական արագությունը: Բացի այդ, խելացի զննարկման գործառույթները ձեզ հնարավորություն են տալիս անվտանգ կերպով ձեզ հետ տանել ձեր գաղտնիությունը, գաղտնաբառերը և էջանիշերը, ուր էլ որ գնաք, ինչը հեշտացնում է ձեր առցանց կյանքը:
mobile-ios-stay-private-online = Մնացեք գաղտնի առցանց
mobile-ios-firefox-gives-you = { -brand-name-firefox }-ը ձեզ ավելի մեծ գաղտնիության պաշտպանություն է տրամադրում, երբ դուք գտնվում եք համացանցում: Ըստ լռելյայնի, մեր բարելավված հետևման պաշտպանությունը արգելափակում է հետևորդներն ու սկրիպտները, ինչպիսիք են սոցիալական ցանցերի հետևորդները, կայքերի միջև թխուկների հետևորդները, կրիպտոմայներները և մատնահետքերը:
mobile-ios-your-browsing-history = Ձեր դիտարկման պատմությունը պատմություն է
mobile-ios-if-you-want = Եթե ցանկանում եք, կարող եք հեշտությամբ ընտրել առցանց որոնումը և անձնական դիտարկման ռեժիմում որոնումը։ Եվ երբ փակում եք անձնական դիտարկման ռեժիմը, ձեր դիտարկման պատմությունը և բոլոր թխուկները ավտոմատ կերպով ջնջվում են ձեր սարքից։
mobile-ios-get-more-firefox = Ստացեք ավելի շատ { -brand-name-firefox } ձեր կյանքում
mobile-ios-add-firefox-across-v2 = Ավելացրեք { -brand-name-firefox }-ը ձեր սարքերում՝ անվտանգ և անխափան զննարկման համար: Համաժամեցրեք ձեր սարքերը՝ ձեր սիրելի էջանիշները, պահպանված մուտքանունները, գաղտնաբառերը և զննարկման պատմությունը ձեզ հետ տանելու համար, ուր էլ որ գնաք: Բացի այդ, ուղարկեք բաց ներդիրները ձեր հեռախոսի և համակարգչի միջև՝ շարունակելու այնտեղից, որտեղ կանգ եք առել:
mobile-ios-get-to-your-go-to = Ավելի արագ հասեք ձեր սիրելի վայրերը ձեր { -brand-name-iphone } և { -brand-name-ipad } սարքերով
mobile-ios-see-your-open-tabs = Տեսեք ձեր բացված ներդիրները, անցյալի որոնումները և սիրելի կայքերը՝ բոլորը մեկ տեղում՝ { -brand-name-firefox-browser }-ի միջոցով՝ { -brand-name-ios }-ի համար։
mobile-ios-own-your-home = Ձեր գլխավոր էկրանի սեփականատերը
mobile-ios-get-to-the-parts = Ավելի արագ հասեք ինտերնետի այն հատվածներին, որոնք ձեզ հետաքրքրում են: Ընտրեք՝ տեսնելու ձեր բոլոր բաց ներդիրները, վերջին որոնումները, էջանիշները և սիրելի կայքերը՝ բոլորը մեկ տեղում:
mobile-ios-find-it-all = Գտեք ամեն ինչ ավելի արագ
mobile-ios-get-search-suggestions = Ստացեք որոնման առաջարկներ որոնման դաշտում և արագ մուտք գործեք այն կայքերին, որոնք ամենաշատն եք այցելում: Մուտքագրեք ձեր որոնման հարցը և ստացեք առաջարկվող և նախկինում որոնված արդյունքներ ձեր նախընտրած որոնողական համակարգերում:
mobile-ios-discover-more-of = Բացահայտեք ավելին այն մասին, թե ինչ եք սիրում
# Obsolete string (expires 26-10-2025)
mobile-ios-open-a-new = Բացեք նոր ներդիր { -brand-name-firefox }-ում՝ տեսնելու համար ձեր ամենաշատ այցելած կայքերը, ձեր վերջին էջանիշները և հայտնի հոդվածները { -brand-name-pocket }-ում: { -brand-name-firefox }-ը ձեզ արագ մուտք է տալիս ձեր վերջին օգտագործած կայքերին՝ օգնելու ձեզ ավելի արագ հասնել ձեր նպատակակետին:
mobile-ios-open-a-new-v2 = Բացեք նոր ներդիր { -brand-name-firefox }-ում՝ տեսնելու համար, թե որ կայքերն եք ամենաշատը այցելում և ձեր վերջին էջանիշները: { -brand-name-firefox }-ը ձեզ արագ մուտք է տալիս ձեր վերջին անգամ օգտագործած կայքերին՝ օգնելու ձեզ ավելի արագ հասնել ձեր նպատակակետին:
mobile-ios-about-mozilla = { -brand-name-mozilla }-ի մասին
# Obsolete string (expires 26-10-2025)
mobile-ios-mozilla-exists-to = { -brand-name-mozilla }-ն գոյություն ունի ինտերնետը որպես բոլորի համար հասանելի հանրային ռեսուրս կառուցելու համար, քանի որ մենք հավատում ենք, որ բաց և անվճար տարբերակը ավելի լավ է, քան փակ և վերահսկվողը։ Մենք ստեղծում ենք այնպիսի արտադրանքներ, ինչպիսիք են { -brand-name-firefox }-ը և { -brand-name-pocket }-ը՝ ընտրությունը, թափանցիկությունը և վերահսկողությունը խթանելու համար։
mobile-ios-mozilla-exists-to-v2 = { -brand-name-mozilla }-ը գոյություն ունի ինտերնետը որպես բոլորի համար հասանելի հանրային ռեսուրս կառուցելու համար, քանի որ մենք հավատում ենք, որ բաց և անվճար տարբերակը ավելի լավ է, քան փակ և վերահսկվողը։ Մենք ստեղծում ենք { -brand-name-firefox }-ի նման արտադրանք՝ ընտրությունը, թափանցիկությունը և վերահսկողությունը խթանելու համար։
