# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at https://mozilla.org/MPL/2.0/.


### URL: https://www-dev.springfield.moz.works/features/adblocker/

# Breadcrumb navigation
features-adblocker-ad-blocking = اشتہار بلاک کرݨ
# Page Title
features-adblocker-meta-title-v2 = اشتہار بلاک کرݨ آلیاں بارے
# Obsolete string (expires 16-09-2025)
features-adblocker-meta-title = اشتہار بلاک کرݨ آلیاں بارے - { -brand-name-firefox }
# HTML page description
features-adblocker-meta-desc = ڄاݨو اشتہار بلاک کرݨ آلے کیویں کم کریندے ہن، اوہ تساں کیتے کیہ کر سڳدے ہن تے { -brand-name-firefox } تساں کوں ٹریکراں تے کوکیز توں کیویں محفوظ رکھیندا ہے۔
features-adblocker-the-ad-blocker-a-tool = اشتہار بلاک کرݨ آلا — تہاݙے پسند تے توجہ آلا براؤزنگ تجربہ کیتے ہک اوزار۔
features-adblocker-in-todays-digital-world = اڄ دے ڈیجیٹل دنیا وچ، ویب مصروف تے بھریا ہویا ہوسڳدا ہے۔ اشتہار بلاک کرݨ آلے طاقتور اوزار ہن جو تساں کوں تہاݙے براؤزنگ تجربے تے قابو ڈیندے ہن، تے تساں فیصلہ کرو جو تہاݙی سکرین تے کیا ظاہر تھیسے۔
features-adblocker-ad-blockers-work = اشتہار بلاک کرݨ آلے دو اہم طریقے نال کم کریندے ہن: ہک تے مواد، جیویں اشتہار، کوں لوڈ تھیوݨ توں روک تے تے ݙوجھے انہاں ویب سائٹاں دے حصیاں کوں بلاک کر تے جو انہاں عناصراں کوں رکھدے ہن۔ ایندے وچ ویڈیو اشتہار، ذاتی نوعیت دے اشتہار جو ویب تے تہاݙا پچھا کریندے ہن، تے تریجھی فریق دے ٹریکر وی شامل ہن۔
# Variables:
#   $firefox (url) - link to https://www.firefox.com/
#   $addons (url) - link to https://blog.mozilla.org/firefox/ad-blocker-roundup-5-adblockers-that-improve-your-internet-experience/
features-adblocker-using-an-adblocker = اشتہار بلاک کرݨ آلا ورتݨ سوکھا ہے۔ براؤزر ایڈ آنز دے طور تے بھروسے دے کئی آپشن دستیاب ہن، جیہڑے تساں کوں تہاݙیاں ضرورتیاں دے مطابق حل ڳولݨ وچ سوکھا کریندے ہن۔ مثال دے طور تے، <a href="{ $firefox }">{ -brand-name-firefox }</a> <a href="{ $addons }">منظور شدہ ایکسٹینشناں دی ہک فہرست</a> پیش کریندا ہے جیہڑی تہاݙی رازداری دا احترام کریندی ہوئی تہاݙے براؤزنگ تجربے کوں بہتر بݨاوݨ کیتے بݨائی ڳئی ہے۔
features-adblocker-finding-the-right = تہاݙے کیتے ٹھیک اشتہار بلاک کرݨ آلا ڳولو
features-adblocker-there-are-many = اشتہار بلاک کرݨ آلے کئی اوزار ڳولݨ کیتے ہن، ہر ہک مختلف ترجیحاں دے مطابق خصوصیات پیش کریندا ہے۔ تہاݙے کیتے ٹھیک ڳولݨ تہاݙیاں خواہشاں تے براؤزنگ عادتاں تے منحصر ہے۔ غور کرݨ کیتے کجھ ٹپس ایہہ ہن:
features-adblocker-tip-1 = <strong>اشتہار بلاک کرݨ:</strong> اگر تساں صرف اشتہار بلاک کرݨ چاہندے ہو، تاں ہک سوکھا تے ہلکا پھلکا آپشن چݨو۔
features-adblocker-tip-2 = <strong>رازداری دے فکرات:</strong> اگر تساں ٹریکراں توں پریشان ہو، تاں ایہو جہیا اشتہار بلاک کرݨ آلا ڳولو جیندے وچ رازداری دیاں خصوصیات پہلے توں موجود ہن۔
features-adblocker-tip-3 = <strong>کسٹمائز کرݨ دی سہولت:</strong> کجھ اشتہار بلاک کرݨ آلے مخصوص سائٹاں کوں وائٹ لسٹ کرݨ یا مخصوص عناصراں کوں بلاک کرݨ کیتے باریک ٹیوننگ دی اجازت ڈیندے ہن۔
features-adblocker-tip-4 = <strong>ڈیوائس مطابقت:</strong> غور کرو جو تہاکوں ایندی ڈیسک ٹاپ، موبائل، یا ݙوہیں کیتے ضرورت ہے۔
features-adblocker-tip-5 = <strong>میلویئر بلاک کرݨ:</strong> کجھ اشتہار بلاک کرݨ آلے خراب اشتہاراں توں بچیندے ہن (جیویں، AdGuard)۔
features-adblocker-tip-6 = <strong>والدین دے کنٹرول:</strong> کارآمد جے تساں نامناسب مواد بلاک کرݨ چاہندے ہو۔
features-adblocker-its-important-to-note = ایہہ نوٹ کرݨا اہم ہے جو کجھ ویب سائٹاں مواد لوڈ کرݨ یا فعالیت فراہم کرݨ کیتے اشتہاراں تے انحصار کریندیاں ہن۔ اشتہار بلاک کرݨ نال خصوصیات خراب تھیسڳدیاں ہن، جیویں ویڈیو نہ چلݨ یا لاگ اِن دے آپشن ناکام تھیوݨ۔ ایہو جہیا اشتہار بلاک کرݨ آلا چݨو جو باقاعدگی نال اپ ڈیٹ تھیندا ہووے تے جے تساں کوں پتہ لڳے جو ہک اشتہار بلاک کرݨ آلا سنگین مسئلے پیدا کریندا ہے، تاں کارکردگی تے مطابقت دا بہتر توازن ڳولݨ کیتے بیا آزماؤ۔
features-adblocker-enhanced-privacy = { -brand-name-firefox } دے نال ودھی ہوئی رازداری تے کارکردگی
features-adblocker-beyond-ad-blockers = اشتہار بلاک کرݨ آلاں توں اگاں، { -brand-name-firefox } وچ بلٹ اِن خصوصیات ہن جو تساں کوں تہاݙی براؤزنگ تے ہور وی ودھیک قابو ڈیندیاں ہن۔ ایہہ اوزار تہاݙی رازداری دی حفاظت وچ مدد کریندے ہن جڈاں تساں اپݨے تجربے کوں کسٹمائز کرو:
features-adblocker-tool-1 = <strong>معیاری موڈ:</strong> ہک متوازن آپشن جو ویب سائٹ دے سوکھے کم کوں برقرار رکھیندے ہوئیں عام ٹریکراں کوں بلاک کریندا ہے۔
features-adblocker-tool-2 = <strong>سخت موڈ:</strong> انہاں ورتݨ آلاں کیتے مثالی جو ودھیک ٹریکراں تے کوکیز کوں بلاک کر تے مضبوط رازداری تحفظ چاہندے ہن۔ نوٹ کرو جو کجھ سائٹاں کوں ایں موڈ وچ ایڈجسٹمنٹ دی ضرورت پیسڳدی ہے۔
features-adblocker-tool-3 = <strong>کسٹم موڈ:</strong> انہاں کیتے جو مکمل کنٹرول چاہندے ہن، کسٹم موڈ تہاکوں چݨݨ دی اجازت ڈیندا ہے جو کیا بلاک کرو، کوکیز توں ٹریکراں تئیں تے ہور وی۔
features-adblocker-to-adjust = ایہناں سیٹنگز کوں ایڈجسٹ کرݨ کیتے، کہیں وی ویب پیج تے ایڈریس بار دے کھٻے پاسے شیلڈ آئیکون تے کلک کرو تے “پروٹیکشن سیٹنگز” چݨو۔ ایندے نال ہک مینو کھلیسی جتھاں تساں اپݨے کیتے تحفظ دا ٹھیک لیول چݨ سڳدو ہو۔
features-adblocker-why-use = اشتہار بلاک کرݨ آلا کیوں ورتو؟
features-adblocker-ad-blockers-do-more = اشتہار بلاک کرݨ آلے صرف اشتہاراں دا انتظام کرݨ توں ودھیک کریندے ہن – ایہہ غیر ضروری مواد گھٹا تے تہاݙی براؤزنگ دی رفتار تے سیکیورٹی کوں بہتر بݨا سڳدے ہن۔ ایہہ تہاکوں ہک ایہو جہیا ویب تجربہ بݨاوݨ دی طاقت ڈیندے ہن جو تہاݙیاں ضرورتیاں دے مطابق ہووے تے بغیر رکاوٹ دے، جیندے نال تساں سبھ توں اہم ڳالھ تے توجہ ڈے سڳدو ہو۔
# Variables:
#   $url (url) - link to https://www.firefox.com/
features-adblocker-explore-hundreds = { -brand-name-firefox } کیتے دستیاب رازداری تے مبنی سینکڑاں ایڈ آنز دریافت کرو تے اپݨے کیتے ٹھیک اوزار ڳولو۔ <a href="{ $url }">اڄ { -brand-name-firefox } ڈاؤن لوڈ کرو</a> تے ایہو جہیا براؤزر تجربہ کرو جو تہاݙی رازداری تے کارکردگی کوں مدنظر رکھ تے بݨایا ڳیا ہے۔
